using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace Logiwall.Infrastructure.Data.Migrations
{
    /// <inheritdoc />
    public partial class InsertIntoStaticDataMapper : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.Sql(@"
                INSERT INTO [dbo].[StaticDataMappers]([Code],[ProviderType] ,[StaticDataId])VALUES('1',0,1)


                DECLARE @json NVARCHAR(MAX) = N'[
  {
    ""id"": ""10000464"",
    ""description"": ""شهرقدس""
  },
  {
    ""id"": ""10000465"",
    ""description"": ""ادیمی""
  },
  {
    ""id"": ""10000466"",
    ""description"": ""ایلخچی""
  },
  {
    ""id"": ""10000467"",
    ""description"": ""بهار (همدان)""
  },
  {
    ""id"": ""10000484"",
    ""description"": ""فیروزکوه""
  },
  {
    ""id"": ""10000555"",
    ""description"": ""ایلام""
  },
  {
    ""id"": ""10000556"",
    ""description"": ""سقز""
  },
  {
    ""id"": ""10000557"",
    ""description"": ""پیرانشهر""
  },
  {
    ""id"": ""10000558"",
    ""description"": ""سپیدان""
  },
  {
    ""id"": ""10000559"",
    ""description"": ""لاهیجان""
  },
  {
    ""id"": ""10000560"",
    ""description"": ""هرات""
  },
  {
    ""id"": ""10000561"",
    ""description"": ""سروستان""
  },
  {
    ""id"": ""10000562"",
    ""description"": ""رشتخوار""
  },
  {
    ""id"": ""10000563"",
    ""description"": ""تکاب""
  },
  {
    ""id"": ""10000564"",
    ""description"": ""حکم آباد""
  },
  {
    ""id"": ""10000565"",
    ""description"": ""کردکوی""
  },
  {
    ""id"": ""10000566"",
    ""description"": ""خوانسار""
  },
  {
    ""id"": ""10000567"",
    ""description"": ""اردکان""
  },
  {
    ""id"": ""10000568"",
    ""description"": ""لالجین""
  },
  {
    ""id"": ""10000569"",
    ""description"": ""اهواز""
  },
  {
    ""id"": ""10000570"",
    ""description"": ""ملکان""
  },
  {
    ""id"": ""10000571"",
    ""description"": ""بابلسر""
  },
  {
    ""id"": ""10000572"",
    ""description"": ""لنگرود""
  },
  {
    ""id"": ""10000573"",
    ""description"": ""لردگان""
  },
  {
    ""id"": ""10000574"",
    ""description"": ""سعادت شهر""
  },
  {
    ""id"": ""10000575"",
    ""description"": ""هچیرود""
  },
  {
    ""id"": ""10000576"",
    ""description"": ""دیوان دره""
  },
  {
    ""id"": ""10000577"",
    ""description"": ""نیشابور""
  },
  {
    ""id"": ""10000578"",
    ""description"": ""شادگان""
  },
  {
    ""id"": ""10000579"",
    ""description"": ""روانسر""
  },
  {
    ""id"": ""10000580"",
    ""description"": ""بیجار""
  },
  {
    ""id"": ""10000581"",
    ""description"": ""اندیمشک""
  },
  {
    ""id"": ""10000582"",
    ""description"": ""تفرش""
  },
  {
    ""id"": ""10000583"",
    ""description"": ""ایوان غرب""
  },
  {
    ""id"": ""10000584"",
    ""description"": ""قره ضیاالدین - چایپاره""
  },
  {
    ""id"": ""2"",
    ""description"": ""تهران""
  },
  {
    ""id"": ""3"",
    ""description"": ""مهر""
  },
  {
    ""id"": ""4"",
    ""description"": ""چورزق""
  },
  {
    ""id"": ""5"",
    ""description"": ""زهوکی""
  },
  {
    ""id"": ""6"",
    ""description"": ""لوندویل""
  },
  {
    ""id"": ""7"",
    ""description"": ""بندر عامری""
  },
  {
    ""id"": ""8"",
    ""description"": ""سربندر""
  },
  {
    ""id"": ""9"",
    ""description"": ""بن ""
  },
  {
    ""id"": ""12"",
    ""description"": ""منطقه آزاد انزلی""
  },
  {
    ""id"": ""14"",
    ""description"": ""ستادی""
  },
  {
    ""id"": ""15"",
    ""description"": ""RW city""
  },
  {
    ""id"": ""16"",
    ""description"": ""طبس گلشن""
  },
  {
    ""id"": ""19"",
    ""description"": ""سجزی""
  },
  {
    ""id"": ""20"",
    ""description"": ""جنت شهر""
  },
  {
    ""id"": ""22"",
    ""description"": ""سورک(میاندورود)""
  },
  {
    ""id"": ""27"",
    ""description"": ""حاجی آباد""
  },
  {
    ""id"": ""29"",
    ""description"": ""تل خسرو""
  },
  {
    ""id"": ""30"",
    ""description"": ""هشتبندی""
  },
  {
    ""id"": ""32"",
    ""description"": ""هلر""
  },
  {
    ""id"": ""33"",
    ""description"": ""ربط""
  },
  {
    ""id"": ""36"",
    ""description"": ""طرقبه""
  },
  {
    ""id"": ""37"",
    ""description"": ""قادرآباد""
  },
  {
    ""id"": ""39"",
    ""description"": ""بختگان""
  },
  {
    ""id"": ""40"",
    ""description"": ""خونسرخ""
  },
  {
    ""id"": ""10000485"",
    ""description"": ""درچه""
  },
  {
    ""id"": ""10000486"",
    ""description"": ""بهنمیر""
  },
  {
    ""id"": ""10000487"",
    ""description"": ""خرم آباد""
  },
  {
    ""id"": ""10000488"",
    ""description"": ""جلفا""
  },
  {
    ""id"": ""10000489"",
    ""description"": ""املش""
  },
  {
    ""id"": ""10000490"",
    ""description"": ""کیش""
  },
  {
    ""id"": ""10000491"",
    ""description"": ""جوین(نقاب)""
  },
  {
    ""id"": ""10000492"",
    ""description"": ""فارسان""
  },
  {
    ""id"": ""10000493"",
    ""description"": ""دهدشت""
  },
  {
    ""id"": ""10000494"",
    ""description"": ""چالدران""
  },
  {
    ""id"": ""10000495"",
    ""description"": ""قیر و کارزین""
  },
  {
    ""id"": ""10000496"",
    ""description"": ""گتوند""
  },
  {
    ""id"": ""10000497"",
    ""description"": ""ریز""
  },
  {
    ""id"": ""10000498"",
    ""description"": ""قلعه گنج""
  },
  {
    ""id"": ""10000499"",
    ""description"": ""تاکستان""
  },
  {
    ""id"": ""10000500"",
    ""description"": ""اوز""
  },
  {
    ""id"": ""10000501"",
    ""description"": ""رودهن""
  },
  {
    ""id"": ""10000502"",
    ""description"": ""گناباد""
  },
  {
    ""id"": ""10000503"",
    ""description"": ""سراوان""
  },
  {
    ""id"": ""10000504"",
    ""description"": ""نی ریز""
  },
  {
    ""id"": ""10000505"",
    ""description"": ""پردیس""
  },
  {
    ""id"": ""10000506"",
    ""description"": ""سنقر کلیایی""
  },
  {
    ""id"": ""10000507"",
    ""description"": ""رودبنه""
  },
  {
    ""id"": ""10000508"",
    ""description"": ""رویان""
  },
  {
    ""id"": ""10000509"",
    ""description"": ""فولادشهر""
  },
  {
    ""id"": ""10000510"",
    ""description"": ""باغستان""
  },
  {
    ""id"": ""10000511"",
    ""description"": ""جناح""
  },
  {
    ""id"": ""10000512"",
    ""description"": ""سردشت""
  },
  {
    ""id"": ""10000513"",
    ""description"": ""آبیک""
  },
  {
    ""id"": ""10000514"",
    ""description"": ""لواسان""
  },
  {
    ""id"": ""10000515"",
    ""description"": ""نجف آباد""
  },
  {
    ""id"": ""10000516"",
    ""description"": ""اقلید""
  },
  {
    ""id"": ""10000517"",
    ""description"": ""گلپایگان""
  },
  {
    ""id"": ""10000518"",
    ""description"": ""رفسنجان""
  },
  {
    ""id"": ""10000519"",
    ""description"": ""قروه""
  },
  {
    ""id"": ""10000520"",
    ""description"": ""فامنین""
  },
  {
    ""id"": ""10000521"",
    ""description"": ""ماکو""
  },
  {
    ""id"": ""10000522"",
    ""description"": ""سراب""
  },
  {
    ""id"": ""10000523"",
    ""description"": ""تفت""
  },
  {
    ""id"": ""10000524"",
    ""description"": ""آران و بیدگل""
  },
  {
    ""id"": ""10000525"",
    ""description"": ""نقده""
  },
  {
    ""id"": ""10000526"",
    ""description"": ""نخل تقی""
  },
  {
    ""id"": ""10000527"",
    ""description"": ""قزوین""
  },
  {
    ""id"": ""10000528"",
    ""description"": ""زرین شهر""
  },
  {
    ""id"": ""10000529"",
    ""description"": ""سرخس""
  },
  {
    ""id"": ""10000530"",
    ""description"": ""بردسکن""
  },
  {
    ""id"": ""10000531"",
    ""description"": ""کمیجان""
  },
  {
    ""id"": ""10000532"",
    ""description"": ""اسلام آبادغرب""
  },
  {
    ""id"": ""10000533"",
    ""description"": ""چغادک""
  },
  {
    ""id"": ""10000534"",
    ""description"": ""آشخانه (مانه و سملقان)""
  },
  {
    ""id"": ""10000535"",
    ""description"": ""بیرجند""
  },
  {
    ""id"": ""10000536"",
    ""description"": ""خرمشهر""
  },
  {
    ""id"": ""10000537"",
    ""description"": ""ملکشاهی""
  },
  {
    ""id"": ""10000538"",
    ""description"": ""شیرود""
  },
  {
    ""id"": ""10000539"",
    ""description"": ""همدان""
  },
  {
    ""id"": ""10000540"",
    ""description"": ""فاضل آباد""
  },
  {
    ""id"": ""10000541"",
    ""description"": ""تایباد""
  },
  {
    ""id"": ""10000542"",
    ""description"": ""گلوگاه""
  },
  {
    ""id"": ""10000543"",
    ""description"": ""فاروج""
  },
  {
    ""id"": ""10000544"",
    ""description"": ""شهرصنعتی الوند""
  },
  {
    ""id"": ""10000545"",
    ""description"": ""چمران""
  },
  {
    ""id"": ""10000546"",
    ""description"": ""کیار""
  },
  {
    ""id"": ""10000547"",
    ""description"": ""هیرمند""
  },
  {
    ""id"": ""10000548"",
    ""description"": ""گوگد و گلشهر""
  },
  {
    ""id"": ""10000549"",
    ""description"": ""امیرکلا""
  },
  {
    ""id"": ""10000550"",
    ""description"": ""محمود آباد نمونه""
  },
  {
    ""id"": ""10000551"",
    ""description"": ""شوط""
  },
  {
    ""id"": ""10000552"",
    ""description"": ""دورود""
  },
  {
    ""id"": ""10000553"",
    ""description"": ""بوکان""
  },
  {
    ""id"": ""10000554"",
    ""description"": ""آبدانان""
  },
  {
    ""id"": ""10000585"",
    ""description"": ""بندر کنگ""
  },
  {
    ""id"": ""10000586"",
    ""description"": ""زاهدان""
  },
  {
    ""id"": ""10000587"",
    ""description"": ""سبزوار""
  },
  {
    ""id"": ""10000588"",
    ""description"": ""بستان آباد""
  },
  {
    ""id"": ""10000589"",
    ""description"": ""آبسرد""
  },
  {
    ""id"": ""10000590"",
    ""description"": ""تبریز""
  },
  {
    ""id"": ""10000591"",
    ""description"": ""هندیجان""
  },
  {
    ""id"": ""10000592"",
    ""description"": ""بندرانزلی""
  },
  {
    ""id"": ""10000593"",
    ""description"": ""گله دار""
  },
  {
    ""id"": ""10000468"",
    ""description"": ""مهریز""
  },
  {
    ""id"": ""10000469"",
    ""description"": ""ابرکوه""
  },
  {
    ""id"": ""10000470"",
    ""description"": ""شیراز""
  },
  {
    ""id"": ""10000471"",
    ""description"": ""پلدشت""
  },
  {
    ""id"": ""10000472"",
    ""description"": ""قرچک""
  },
  {
    ""id"": ""10000473"",
    ""description"": ""دهگلان""
  },
  {
    ""id"": ""10000474"",
    ""description"": ""میرجاوه""
  },
  {
    ""id"": ""10000475"",
    ""description"": ""موچش""
  },
  {
    ""id"": ""10000476"",
    ""description"": ""اسدآباد""
  },
  {
    ""id"": ""10000477"",
    ""description"": ""خان ببین""
  },
  {
    ""id"": ""10000478"",
    ""description"": ""کنگان""
  },
  {
    ""id"": ""10000479"",
    ""description"": ""مسجد سلیمان""
  },
  {
    ""id"": ""10000480"",
    ""description"": ""آغاجاری""
  },
  {
    ""id"": ""10000481"",
    ""description"": ""مهاباد""
  },
  {
    ""id"": ""10000482"",
    ""description"": ""مشگین شهر""
  },
  {
    ""id"": ""10000483"",
    ""description"": ""شهرکرد""
  },
  {
    ""id"": ""10000883"",
    ""description"": ""پارس آباد""
  },
  {
    ""id"": ""10000884"",
    ""description"": ""سرایان""
  },
  {
    ""id"": ""10000885"",
    ""description"": ""بناب""
  },
  {
    ""id"": ""10000886"",
    ""description"": ""داراب""
  },
  {
    ""id"": ""10000887"",
    ""description"": ""اشتهارد""
  },
  {
    ""id"": ""10000888"",
    ""description"": ""خشکبیجار""
  },
  {
    ""id"": ""10000889"",
    ""description"": ""خاش""
  },
  {
    ""id"": ""10000890"",
    ""description"": ""بندرعباس""
  },
  {
    ""id"": ""10000891"",
    ""description"": ""بانه""
  },
  {
    ""id"": ""10000892"",
    ""description"": ""اهرم""
  },
  {
    ""id"": ""10000893"",
    ""description"": ""هفتگل""
  },
  {
    ""id"": ""10000894"",
    ""description"": ""زیرآب و پل سفید""
  },
  {
    ""id"": ""10000895"",
    ""description"": ""قائم شهر""
  },
  {
    ""id"": ""10000896"",
    ""description"": ""تیران""
  },
  {
    ""id"": ""10000897"",
    ""description"": ""لیسار""
  },
  {
    ""id"": ""10000898"",
    ""description"": ""شهریار""
  },
  {
    ""id"": ""10000899"",
    ""description"": ""آزادشهر""
  },
  {
    ""id"": ""10000900"",
    ""description"": ""کلیبر""
  },
  {
    ""id"": ""10000901"",
    ""description"": ""یاسوج""
  },
  {
    ""id"": ""10000902"",
    ""description"": ""ارومیه""
  },
  {
    ""id"": ""10000903"",
    ""description"": ""منجیل""
  },
  {
    ""id"": ""10000904"",
    ""description"": ""پلدختر""
  },
  {
    ""id"": ""10000905"",
    ""description"": ""رستم آباد""
  },
  {
    ""id"": ""10000906"",
    ""description"": ""بشرویه""
  },
  {
    ""id"": ""10000907"",
    ""description"": ""ورامین""
  },
  {
    ""id"": ""10000908"",
    ""description"": ""بندرریگ""
  },
  {
    ""id"": ""10000909"",
    ""description"": ""پیشوا""
  },
  {
    ""id"": ""10000910"",
    ""description"": ""ازنا""
  },
  {
    ""id"": ""10000911"",
    ""description"": ""میامی""
  },
  {
    ""id"": ""10000912"",
    ""description"": ""رزن""
  },
  {
    ""id"": ""10000913"",
    ""description"": ""میناب""
  },
  {
    ""id"": ""10000914"",
    ""description"": ""ماهشهر""
  },
  {
    ""id"": ""10000915"",
    ""description"": ""دلیجان""
  },
  {
    ""id"": ""10000916"",
    ""description"": ""گراش""
  },
  {
    ""id"": ""10000917"",
    ""description"": ""بافت""
  },
  {
    ""id"": ""10000918"",
    ""description"": ""کلاله""
  },
  {
    ""id"": ""10000919"",
    ""description"": ""ملارد""
  },
  {
    ""id"": ""10000920"",
    ""description"": ""نرماشیر""
  },
  {
    ""id"": ""10000921"",
    ""description"": ""کومله""
  },
  {
    ""id"": ""10000634"",
    ""description"": ""فیض آباد (مه ولات)""
  },
  {
    ""id"": ""10000635"",
    ""description"": ""بندرجاسک""
  },
  {
    ""id"": ""10000636"",
    ""description"": ""دره شهر""
  },
  {
    ""id"": ""10000637"",
    ""description"": ""کلاچای""
  },
  {
    ""id"": ""10000638"",
    ""description"": ""فرادنبه""
  },
  {
    ""id"": ""10000639"",
    ""description"": ""فنوج""
  },
  {
    ""id"": ""10000640"",
    ""description"": ""کوهدشت""
  },
  {
    ""id"": ""10000641"",
    ""description"": ""خمام""
  },
  {
    ""id"": ""10000642"",
    ""description"": ""یزد""
  },
  {
    ""id"": ""10000643"",
    ""description"": ""میانه""
  },
  {
    ""id"": ""10000644"",
    ""description"": ""بندر دیر""
  },
  {
    ""id"": ""10000645"",
    ""description"": ""آذرشهر""
  },
  {
    ""id"": ""10000646"",
    ""description"": ""زرقان""
  },
  {
    ""id"": ""10000647"",
    ""description"": ""سرپل ذهاب""
  },
  {
    ""id"": ""10000648"",
    ""description"": ""رستم""
  },
  {
    ""id"": ""10000649"",
    ""description"": ""کرمانشاه""
  },
  {
    ""id"": ""10000650"",
    ""description"": ""چمستان""
  },
  {
    ""id"": ""10000651"",
    ""description"": ""سیرجان""
  },
  {
    ""id"": ""10000652"",
    ""description"": ""خانمیرزا""
  },
  {
    ""id"": ""10000653"",
    ""description"": ""الشتر""
  },
  {
    ""id"": ""10000654"",
    ""description"": ""ایرانشهر""
  },
  {
    ""id"": ""10000655"",
    ""description"": ""نورآبادممسنی""
  },
  {
    ""id"": ""10000656"",
    ""description"": ""بابل""
  },
  {
    ""id"": ""10000657"",
    ""description"": ""سیاهکل""
  },
  {
    ""id"": ""10000658"",
    ""description"": ""شهرضا""
  },
  {
    ""id"": ""10000659"",
    ""description"": ""سلمان شهر(متل قو)""
  },
  {
    ""id"": ""10000660"",
    ""description"": ""رومشگان""
  },
  {
    ""id"": ""10000661"",
    ""description"": ""شفت""
  },
  {
    ""id"": ""10000662"",
    ""description"": ""زرند""
  },
  {
    ""id"": ""10000663"",
    ""description"": ""کامیاران""
  },
  {
    ""id"": ""10000664"",
    ""description"": ""شاندرمن""
  },
  {
    ""id"": ""10000665"",
    ""description"": ""بندر کیاشهر""
  },
  {
    ""id"": ""10000666"",
    ""description"": ""آستارا""
  },
  {
    ""id"": ""10000667"",
    ""description"": ""بندردیلم""
  },
  {
    ""id"": ""10000668"",
    ""description"": ""بندردلوار""
  },
  {
    ""id"": ""10000669"",
    ""description"": ""چوبر""
  },
  {
    ""id"": ""10000670"",
    ""description"": ""رودسر""
  },
  {
    ""id"": ""10000671"",
    ""description"": ""خرم آباد (مازندران)""
  },
  {
    ""id"": ""10000672"",
    ""description"": ""آباده""
  },
  {
    ""id"": ""10000673"",
    ""description"": ""هرسین""
  },
  {
    ""id"": ""10000674"",
    ""description"": ""بوانات""
  },
  {
    ""id"": ""10000675"",
    ""description"": ""نایی سر""
  },
  {
    ""id"": ""10000676"",
    ""description"": ""سمنان""
  },
  {
    ""id"": ""10000677"",
    ""description"": ""بشاگرد""
  },
  {
    ""id"": ""10000678"",
    ""description"": ""کیاکلا""
  },
  {
    ""id"": ""10000679"",
    ""description"": ""زابل""
  },
  {
    ""id"": ""10000680"",
    ""description"": ""شازند""
  },
  {
    ""id"": ""10000681"",
    ""description"": ""سیب سوران""
  },
  {
    ""id"": ""10000682"",
    ""description"": ""فراهان""
  },
  {
    ""id"": ""10000683"",
    ""description"": ""کاکی""
  },
  {
    ""id"": ""10000684"",
    ""description"": ""بندر سیریک""
  },
  {
    ""id"": ""10000685"",
    ""description"": ""گرمسار""
  },
  {
    ""id"": ""10000686"",
    ""description"": ""تالش""
  },
  {
    ""id"": ""10000687"",
    ""description"": ""فراشبند""
  },
  {
    ""id"": ""10000688"",
    ""description"": ""رامهرمز""
  },
  {
    ""id"": ""10000689"",
    ""description"": ""بندر خمیر""
  },
  {
    ""id"": ""10000690"",
    ""description"": ""جویم""
  },
  {
    ""id"": ""10000691"",
    ""description"": ""گچساران""
  },
  {
    ""id"": ""10000692"",
    ""description"": ""گنبدکاوس""
  },
  {
    ""id"": ""10000693"",
    ""description"": ""اقبالیه""
  },
  {
    ""id"": ""10000694"",
    ""description"": ""خلخال""
  },
  {
    ""id"": ""10000695"",
    ""description"": ""قم ""
  },
  {
    ""id"": ""10000696"",
    ""description"": ""جغتای""
  },
  {
    ""id"": ""10000697"",
    ""description"": ""مهرستان""
  },
  {
    ""id"": ""10000698"",
    ""description"": ""سمیرم""
  },
  {
    ""id"": ""10000699"",
    ""description"": ""رودبار جنوب""
  },
  {
    ""id"": ""10000700"",
    ""description"": ""خرمدره""
  },
  {
    ""id"": ""10000701"",
    ""description"": ""گلدشت""
  },
  {
    ""id"": ""10000702"",
    ""description"": ""ثلاث باباجانی""
  },
  {
    ""id"": ""10000703"",
    ""description"": ""بافق""
  },
  {
    ""id"": ""10000704"",
    ""description"": ""سلطان آباد""
  },
  {
    ""id"": ""10000705"",
    ""description"": ""بهبهان""
  },
  {
    ""id"": ""10000706"",
    ""description"": ""شهر جدید هشتگرد""
  },
  {
    ""id"": ""10000707"",
    ""description"": ""کنارک""
  },
  {
    ""id"": ""10000708"",
    ""description"": ""آبپخش""
  },
  {
    ""id"": ""10000709"",
    ""description"": ""طبل""
  },
  {
    ""id"": ""10000710"",
    ""description"": ""مهاجران ( اراک)""
  },
  {
    ""id"": ""10000711"",
    ""description"": ""قیدار - خدابنده""
  },
  {
    ""id"": ""10000712"",
    ""description"": ""مرند""
  },
  {
    ""id"": ""10000713"",
    ""description"": ""مبارکه""
  },
  {
    ""id"": ""10000714"",
    ""description"": ""انار""
  },
  {
    ""id"": ""10000715"",
    ""description"": ""عسلویه""
  },
  {
    ""id"": ""10000716"",
    ""description"": ""آستانه اشرفیه""
  },
  {
    ""id"": ""10000717"",
    ""description"": ""اسکو""
  },
  {
    ""id"": ""10000718"",
    ""description"": ""الیگودرز""
  },
  {
    ""id"": ""10000719"",
    ""description"": ""تیرور""
  },
  {
    ""id"": ""10000720"",
    ""description"": ""بیله سوار""
  },
  {
    ""id"": ""10000721"",
    ""description"": ""تنکابن""
  },
  {
    ""id"": ""10000722"",
    ""description"": ""اشنویه""
  },
  {
    ""id"": ""10000723"",
    ""description"": ""صومعه سرا""
  },
  {
    ""id"": ""10000724"",
    ""description"": ""زنجان""
  },
  {
    ""id"": ""10000725"",
    ""description"": ""ابوموسی""
  },
  {
    ""id"": ""10000726"",
    ""description"": ""مادوان""
  },
  {
    ""id"": ""10000727"",
    ""description"": ""حاجی آباد (زرین دشت)""
  },
  {
    ""id"": ""10000728"",
    ""description"": ""محمودآباد""
  },
  {
    ""id"": ""10000729"",
    ""description"": ""هامون""
  },
  {
    ""id"": ""10000730"",
    ""description"": ""خمین""
  },
  {
    ""id"": ""10000731"",
    ""description"": ""نوشهر""
  },
  {
    ""id"": ""10000732"",
    ""description"": ""نکا""
  },
  {
    ""id"": ""10000733"",
    ""description"": ""رودان""
  },
  {
    ""id"": ""10000734"",
    ""description"": ""گرگان""
  },
  {
    ""id"": ""10000735"",
    ""description"": ""چهاربرج""
  },
  {
    ""id"": ""10000736"",
    ""description"": ""قروه درگزین""
  },
  {
    ""id"": ""10000737"",
    ""description"": ""درگز""
  },
  {
    ""id"": ""10000738"",
    ""description"": ""نشتارود""
  },
  {
    ""id"": ""10000739"",
    ""description"": ""نورآباد دلفان (لرستان)""
  },
  {
    ""id"": ""10000740"",
    ""description"": ""ارسنجان""
  },
  {
    ""id"": ""10000741"",
    ""description"": ""علی آبادکتول""
  },
  {
    ""id"": ""10000742"",
    ""description"": ""علامرودشت""
  },
  {
    ""id"": ""10000743"",
    ""description"": ""قوچان""
  },
  {
    ""id"": ""10000744"",
    ""description"": ""پیربکران""
  },
  {
    ""id"": ""10000745"",
    ""description"": ""چادگان""
  },
  {
    ""id"": ""10000746"",
    ""description"": ""بجستان""
  },
  {
    ""id"": ""10000747"",
    ""description"": ""شاهرود""
  },
  {
    ""id"": ""10000748"",
    ""description"": ""کردآباد""
  },
  {
    ""id"": ""10000749"",
    ""description"": ""رشت""
  },
  {
    ""id"": ""10000750"",
    ""description"": ""میمه""
  },
  {
    ""id"": ""10000751"",
    ""description"": ""شوشتر""
  },
  {
    ""id"": ""10000752"",
    ""description"": ""ملایر""
  },
  {
    ""id"": ""10000753"",
    ""description"": ""فاریاب""
  },
  {
    ""id"": ""10000754"",
    ""description"": ""میاندوآب""
  },
  {
    ""id"": ""10000755"",
    ""description"": ""دانسفهان""
  },
  {
    ""id"": ""10000756"",
    ""description"": ""لار""
  },
  {
    ""id"": ""10000757"",
    ""description"": ""جاجرم""
  },
  {
    ""id"": ""10000758"",
    ""description"": ""خنج""
  },
  {
    ""id"": ""10000759"",
    ""description"": ""جهرم""
  },
  {
    ""id"": ""10000760"",
    ""description"": ""سی سخت""
  },
  {
    ""id"": ""10000761"",
    ""description"": ""فسا""
  },
  {
    ""id"": ""10000762"",
    ""description"": ""رودبار""
  },
  {
    ""id"": ""10000763"",
    ""description"": ""جویبار""
  },
  {
    ""id"": ""10000764"",
    ""description"": ""ساوه""
  },
  {
    ""id"": ""10000765"",
    ""description"": ""بوئین زهرا""
  },
  {
    ""id"": ""10000766"",
    ""description"": ""بجنورد""
  },
  {
    ""id"": ""10000767"",
    ""description"": ""کرمان""
  },
  {
    ""id"": ""10000768"",
    ""description"": ""کاشمر""
  },
  {
    ""id"": ""10000769"",
    ""description"": ""آق قلا""
  },
  {
    ""id"": ""10000770"",
    ""description"": ""نهاوند""
  },
  {
    ""id"": ""10000771"",
    ""description"": ""برازجان""
  },
  {
    ""id"": ""10000772"",
    ""description"": ""دماوند""
  },
  {
    ""id"": ""10000773"",
    ""description"": ""دهلران""
  },
  {
    ""id"": ""10000774"",
    ""description"": ""ایوان کی""
  },
  {
    ""id"": ""10000775"",
    ""description"": ""مهران""
  },
  {
    ""id"": ""10000776"",
    ""description"": ""کاشان""
  },
  {
    ""id"": ""10000777"",
    ""description"": ""زهک""
  },
  {
    ""id"": ""10000778"",
    ""description"": ""بنک""
  },
  {
    ""id"": ""10000779"",
    ""description"": ""هیدج""
  },
  {
    ""id"": ""10000780"",
    ""description"": ""امیدیه""
  },
  {
    ""id"": ""10000781"",
    ""description"": ""بنجار""
  },
  {
    ""id"": ""10000782"",
    ""description"": ""رامشیر""
  },
  {
    ""id"": ""10000783"",
    ""description"": ""بروجن""
  },
  {
    ""id"": ""10000784"",
    ""description"": ""نائین""
  },
  {
    ""id"": ""10000785"",
    ""description"": ""کوار""
  },
  {
    ""id"": ""10000786"",
    ""description"": ""کوثر گیوی""
  },
  {
    ""id"": ""10000787"",
    ""description"": ""دامغان""
  },
  {
    ""id"": ""10000788"",
    ""description"": ""فلاورجان""
  },
  {
    ""id"": ""10000789"",
    ""description"": ""فریدونکنار""
  },
  {
    ""id"": ""10000790"",
    ""description"": ""نظرآباد""
  },
  {
    ""id"": ""10000791"",
    ""description"": ""اردستان""
  },
  {
    ""id"": ""10000792"",
    ""description"": ""وحدتیه""
  },
  {
    ""id"": ""10000793"",
    ""description"": ""اراک""
  },
  {
    ""id"": ""10000794"",
    ""description"": ""بهشهر""
  },
  {
    ""id"": ""10000795"",
    ""description"": ""بیرم""
  },
  {
    ""id"": ""10000796"",
    ""description"": ""مشهد""
  },
  {
    ""id"": ""10000797"",
    ""description"": ""ماسال""
  },
  {
    ""id"": ""10000798"",
    ""description"": ""خفر""
  },
  {
    ""id"": ""10000799"",
    ""description"": ""نمین""
  },
  {
    ""id"": ""10000800"",
    ""description"": ""راور""
  },
  {
    ""id"": ""10000801"",
    ""description"": ""کرند""
  },
  {
    ""id"": ""10000802"",
    ""description"": ""بم ""
  },
  {
    ""id"": ""10000803"",
    ""description"": ""گرمه""
  },
  {
    ""id"": ""10000804"",
    ""description"": ""سرعین""
  },
  {
    ""id"": ""10000805"",
    ""description"": ""مهدی شهر و شهمیرزاد""
  },
  {
    ""id"": ""10000806"",
    ""description"": ""عباس آباد""
  },
  {
    ""id"": ""10000807"",
    ""description"": ""قشم""
  },
  {
    ""id"": ""10000808"",
    ""description"": ""کهنوج""
  },
  {
    ""id"": ""10000809"",
    ""description"": ""مینودشت""
  },
  {
    ""id"": ""10000810"",
    ""description"": ""چوار""
  },
  {
    ""id"": ""10000811"",
    ""description"": ""کنگاور""
  },
  {
    ""id"": ""10000812"",
    ""description"": ""سرخرود""
  },
  {
    ""id"": ""10000813"",
    ""description"": ""میبد""
  },
  {
    ""id"": ""10000814"",
    ""description"": ""سنگر""
  },
  {
    ""id"": ""10000815"",
    ""description"": ""چابکسر""
  },
  {
    ""id"": ""10000816"",
    ""description"": ""سامان""
  },
  {
    ""id"": ""10000817"",
    ""description"": ""نیک شهر""
  },
  {
    ""id"": ""10000818"",
    ""description"": ""عنبرآباد""
  },
  {
    ""id"": ""10000819"",
    ""description"": ""زرندیه""
  },
  {
    ""id"": ""10000820"",
    ""description"": ""عالی شهر""
  },
  {
    ""id"": ""10000821"",
    ""description"": ""بستک""
  },
  {
    ""id"": ""10000822"",
    ""description"": ""بدره""
  },
  {
    ""id"": ""10000823"",
    ""description"": ""بازرگان""
  },
  {
    ""id"": ""10000824"",
    ""description"": ""محلات""
  },
  {
    ""id"": ""10000825"",
    ""description"": ""تربت جام""
  },
  {
    ""id"": ""10000826"",
    ""description"": ""شبستر""
  },
  {
    ""id"": ""10000922"",
    ""description"": ""شاهین دژ""
  },
  {
    ""id"": ""10000923"",
    ""description"": ""بردسیر""
  },
  {
    ""id"": ""10000924"",
    ""description"": ""اردبیل""
  },
  {
    ""id"": ""10000925"",
    ""description"": ""صحنه""
  },
  {
    ""id"": ""10000926"",
    ""description"": ""بلداجی""
  },
  {
    ""id"": ""10000927"",
    ""description"": ""سرابله""
  },
  {
    ""id"": ""10000928"",
    ""description"": ""شوش دانیال""
  },
  {
    ""id"": ""1000981"",
    ""description"": ""رباط کریم""
  },
  {
    ""id"": ""10000929"",
    ""description"": ""شیروان""
  },
  {
    ""id"": ""10000930"",
    ""description"": ""کرج""
  },
  {
    ""id"": ""10000594"",
    ""description"": ""هرند""
  },
  {
    ""id"": ""10000595"",
    ""description"": ""اهر""
  },
  {
    ""id"": ""10000596"",
    ""description"": ""چناران""
  },
  {
    ""id"": ""10000597"",
    ""description"": ""نیمور""
  },
  {
    ""id"": ""10000598"",
    ""description"": ""فیروزآباد""
  },
  {
    ""id"": ""10000599"",
    ""description"": ""خواف""
  },
  {
    ""id"": ""10000600"",
    ""description"": ""فریدن""
  },
  {
    ""id"": ""10000601"",
    ""description"": ""میمند""
  },
  {
    ""id"": ""10000602"",
    ""description"": ""چابهار""
  },
  {
    ""id"": ""10000603"",
    ""description"": ""منوجان""
  },
  {
    ""id"": ""10000604"",
    ""description"": ""تربت حیدریه""
  },
  {
    ""id"": ""10000605"",
    ""description"": ""کازرون""
  },
  {
    ""id"": ""10000606"",
    ""description"": ""خورزوق (اصفهان)""
  },
  {
    ""id"": ""10000607"",
    ""description"": ""استهبان""
  },
  {
    ""id"": ""10000608"",
    ""description"": ""اسفراین""
  },
  {
    ""id"": ""10000609"",
    ""description"": ""لیکک""
  },
  {
    ""id"": ""10000610"",
    ""description"": ""بندر گز""
  },
  {
    ""id"": ""10000611"",
    ""description"": ""قائمیه""
  },
  {
    ""id"": ""10000612"",
    ""description"": ""فریمان""
  },
  {
    ""id"": ""10000613"",
    ""description"": ""تویسرکان""
  },
  {
    ""id"": ""10000614"",
    ""description"": ""سردرود""
  },
  {
    ""id"": ""10000615"",
    ""description"": ""درگهان""
  },
  {
    ""id"": ""10000616"",
    ""description"": ""ابهر""
  },
  {
    ""id"": ""10000617"",
    ""description"": ""خمینی شهر""
  },
  {
    ""id"": ""10000618"",
    ""description"": ""جم ""
  },
  {
    ""id"": ""10000619"",
    ""description"": ""بوشهر""
  },
  {
    ""id"": ""10000620"",
    ""description"": ""بردستان""
  },
  {
    ""id"": ""10000621"",
    ""description"": ""شریف آباد""
  },
  {
    ""id"": ""10000622"",
    ""description"": ""طارم""
  },
  {
    ""id"": ""10000623"",
    ""description"": ""فومن""
  },
  {
    ""id"": ""10000624"",
    ""description"": ""خومه زار""
  },
  {
    ""id"": ""10000625"",
    ""description"": ""کوچصفهان""
  },
  {
    ""id"": ""10000626"",
    ""description"": ""شیرگاه""
  },
  {
    ""id"": ""10000627"",
    ""description"": ""ملاثانی""
  },
  {
    ""id"": ""10000628"",
    ""description"": ""هفشجان""
  },
  {
    ""id"": ""10000629"",
    ""description"": ""خسروشاه""
  },
  {
    ""id"": ""10000630"",
    ""description"": ""دهاقان""
  },
  {
    ""id"": ""10000631"",
    ""description"": ""باغملک""
  },
  {
    ""id"": ""10000632"",
    ""description"": ""کوهستک""
  },
  {
    ""id"": ""10000633"",
    ""description"": ""دزفول""
  },
  {
    ""id"": ""10000827"",
    ""description"": ""فردوس ( خراسان)""
  },
  {
    ""id"": ""10000828"",
    ""description"": ""بندرلنگه""
  },
  {
    ""id"": ""10000829"",
    ""description"": ""خشت""
  },
  {
    ""id"": ""10000830"",
    ""description"": ""بندرترکمن""
  },
  {
    ""id"": ""10000831"",
    ""description"": ""ایذه""
  },
  {
    ""id"": ""10000832"",
    ""description"": ""گرمی""
  },
  {
    ""id"": ""10000833"",
    ""description"": ""اندیشه""
  },
  {
    ""id"": ""10000834"",
    ""description"": ""جوانرود""
  },
  {
    ""id"": ""10000835"",
    ""description"": ""بروجرد""
  },
  {
    ""id"": ""10000836"",
    ""description"": ""هادی شهر""
  },
  {
    ""id"": ""10000837"",
    ""description"": ""لالی""
  },
  {
    ""id"": ""10000838"",
    ""description"": ""سلماس""
  },
  {
    ""id"": ""10000839"",
    ""description"": ""کتالم و سادات شهر""
  },
  {
    ""id"": ""10000840"",
    ""description"": ""ساری""
  },
  {
    ""id"": ""10000841"",
    ""description"": ""شاهین شهر""
  },
  {
    ""id"": ""10000842"",
    ""description"": ""لشت نشاء""
  },
  {
    ""id"": ""10000843"",
    ""description"": ""خوی""
  },
  {
    ""id"": ""10000844"",
    ""description"": ""علویجه""
  },
  {
    ""id"": ""10000845"",
    ""description"": ""رحیم آباد""
  },
  {
    ""id"": ""10000846"",
    ""description"": ""لامرد""
  },
  {
    ""id"": ""10000847"",
    ""description"": ""گیلانغرب""
  },
  {
    ""id"": ""10000848"",
    ""description"": ""بندرگناوه""
  },
  {
    ""id"": ""10000849"",
    ""description"": ""پارسیان""
  },
  {
    ""id"": ""10000850"",
    ""description"": ""لوشان""
  },
  {
    ""id"": ""10000851"",
    ""description"": ""سرخه""
  },
  {
    ""id"": ""10000852"",
    ""description"": ""بادرود و نطنز""
  },
  {
    ""id"": ""10000853"",
    ""description"": ""شهر ابریشم""
  },
  {
    ""id"": ""10000854"",
    ""description"": ""گروگ""
  },
  {
    ""id"": ""10000855"",
    ""description"": ""کلاردشت""
  },
  {
    ""id"": ""10000856"",
    ""description"": ""جالق""
  },
  {
    ""id"": ""10000857"",
    ""description"": ""گلبهار""
  },
  {
    ""id"": ""10000858"",
    ""description"": ""چالوس""
  },
  {
    ""id"": ""10000859"",
    ""description"": ""فرخ شهر""
  },
  {
    ""id"": ""10000860"",
    ""description"": ""رامیان""
  },
  {
    ""id"": ""10000861"",
    ""description"": ""رامسر""
  },
  {
    ""id"": ""10000862"",
    ""description"": ""صوفیان""
  },
  {
    ""id"": ""10000863"",
    ""description"": ""شبانکاره""
  },
  {
    ""id"": ""10000864"",
    ""description"": ""مریوان""
  },
  {
    ""id"": ""10000865"",
    ""description"": ""عجب شیر""
  },
  {
    ""id"": ""10000866"",
    ""description"": ""آبادان""
  },
  {
    ""id"": ""10000867"",
    ""description"": ""صفاشهر""
  },
  {
    ""id"": ""10000868"",
    ""description"": ""محمدیه""
  },
  {
    ""id"": ""10000869"",
    ""description"": ""رضوانشهر""
  },
  {
    ""id"": ""10000870"",
    ""description"": ""پاوه""
  },
  {
    ""id"": ""10000871"",
    ""description"": ""سهند""
  },
  {
    ""id"": ""10000872"",
    ""description"": ""سنندج""
  },
  {
    ""id"": ""10000873"",
    ""description"": ""بومهن""
  },
  {
    ""id"": ""10000874"",
    ""description"": ""شلمان""
  },
  {
    ""id"": ""10000875"",
    ""description"": ""رستم کلا""
  },
  {
    ""id"": ""10000876"",
    ""description"": ""پره سر""
  },
  {
    ""id"": ""10000877"",
    ""description"": ""اصفهان""
  },
  {
    ""id"": ""10000878"",
    ""description"": ""خلیل آباد""
  },
  {
    ""id"": ""10000879"",
    ""description"": ""هشترود""
  },
  {
    ""id"": ""10000880"",
    ""description"": ""فیروزان""
  },
  {
    ""id"": ""10000881"",
    ""description"": ""خورموج""
  },
  {
    ""id"": ""10000882"",
    ""description"": ""ورزنه""
  },
  {
    ""id"": ""10000931"",
    ""description"": ""قائن""
  },
  {
    ""id"": ""10000932"",
    ""description"": ""مراغه""
  },
  {
    ""id"": ""10000933"",
    ""description"": ""آمل""
  },
  {
    ""id"": ""10000934"",
    ""description"": ""کبودرآهنگ""
  },
  {
    ""id"": ""10000935"",
    ""description"": ""اشکنان""
  },
  {
    ""id"": ""10000936"",
    ""description"": ""مرودشت""
  },
  {
    ""id"": ""10000937"",
    ""description"": ""شهربابک""
  },
  {
    ""id"": ""10000938"",
    ""description"": ""دولت آباد(اصفهان)""
  },
  {
    ""id"": ""10000939"",
    ""description"": ""آشتیان""
  },
  {
    ""id"": ""10000940"",
    ""description"": ""جیرفت""
  },
  {
    ""id"": ""10000941"",
    ""description"": ""اسالم""
  },
  {
    ""id"": ""10000942"",
    ""description"": ""نور""
  },
  {
    ""id"": ""10000943"",
    ""description"": ""گالیکش""
  },
  {
    ""id"": ""10000944"",
    ""description"": ""هشتگرد""
  },
  {
    ""id"": ""1000921"",
    ""description"": ""ایسین و تازیان""
  },
  {
    ""id"": ""1000862"",
    ""description"": ""باروق""
  },
  {
    ""id"": ""1000881"",
    ""description"": ""نهبندان""
  },
  {
    ""id"": ""1000807"",
    ""description"": ""بهارستان (تهران)""
  },
  {
    ""id"": ""1000808"",
    ""description"": ""نسیم شهر""
  },
  {
    ""id"": ""1000809"",
    ""description"": ""باقرشهر""
  },
  {
    ""id"": ""1000810"",
    ""description"": ""فشافویه""
  },
  {
    ""id"": ""1000811"",
    ""description"": ""نصیر شهر""
  },
  {
    ""id"": ""1000841"",
    ""description"": ""قهدریجان""
  },
  {
    ""id"": ""1000902"",
    ""description"": ""خلیل شهر""
  },
  {
    ""id"": ""1000781"",
    ""description"": ""اردل""
  },
  {
    ""id"": ""1000801"",
    ""description"": ""رباط کریم""
  },
  {
    ""id"": ""1000802"",
    ""description"": ""اسلامشهر""
  },
  {
    ""id"": ""1000803"",
    ""description"": ""احمد آباد مستوفی""
  },
  {
    ""id"": ""1000804"",
    ""description"": ""پرند""
  },
  {
    ""id"": ""1000805"",
    ""description"": ""شاطره""
  },
  {
    ""id"": ""1000806"",
    ""description"": ""چهاردانگه""
  },
  {
    ""id"": ""1000861"",
    ""description"": ""سنگان""
  },
  {
    ""id"": ""1000901"",
    ""description"": ""سوسنگرد""
  },
  {
    ""id"": ""1000903"",
    ""description"": ""خرو""
  },
  {
    ""id"": ""1000904"",
    ""description"": ""باخزر""
  },
  {
    ""id"": ""1000761"",
    ""description"": ""کردان""
  },
  {
    ""id"": ""1000821"",
    ""description"": ""کویرتایر (بیرجند)""
  },
  {
    ""id"": ""1000941"",
    ""description"": ""قره آغاج""
  },
  {
    ""id"": ""1000963"",
    ""description"": ""تبت""
  },
  {
    ""id"": ""1000964"",
    ""description"": ""شلمزار""
  }
]'
                INSERT INTO [dbo].[StaticDataMappers]([Code],[ProviderType] ,[StaticDataId])
                SELECT j.id, 0, SD.Id
                FROM OPENJSON(@json)
                WITH (id Nvarchar(50), description Nvarchar(100)) AS j
                INNER JOIN [dbo].[StaticDatas] AS SD ON SD.Title = J.description
                WHERE SD.Type = 12
            ");
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {

        }
    }
}
